#include <iostream>
/*
Задание 5
Программа принимает 4 вещественных числа : число1, число2, число3,
число4
Выведите на экран числа в таком порядке : число3, число 2, число4, число1

*/


int main() {

	float a = 0, b = 0, c = 0, d = 0;

	std::cin >> a >> b >> c >> d;

	std::cout << c << ", " << b << ", " << d << ", " << a;




}